rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
// Low level BLDC drive module

/* Includes ******************************************************/
#include "MC_dev_drive.h"

#include "stm8s_lib.h"

#include "MC_stm8s_param.h"

#include "MC_Faults.h"

#include "MC_vtimer.h" 						
#include "MC_BLDC_timers.h" 			
#include "MC_bldc_motor.h"				
#include "MC_BLDC_Motor_Param.h"  
#include "MC_BLDC_Drive_Param.h"  
#include "MC_StateMachine.h"

#include "uart.h"
#include "stm8s_adc1.h"
#include "stm8s_tim1.h"

//#define DEV_CUT_1

#ifndef PWM_LOWSIDE_OUTPUT_ENABLE
	#define LS_GPIO_CONTROL

	#if (defined(LS_GPIO_CONTROL) && (FAST_DEMAG != 0))
		#error "Invalid configuration: Is not possible to enable the FAST_DEMAG option with LS_GPIO_CONTROL"
	#endif
#endif

/*private prototypes ******************************************************/
void dev_BLDC_driveUpdate(void);
void Application_ADC_Manager( void );
void GetCurrent(void);
void GetBusVoltage(void);
void GetStepTime(void);
void SpeedMeasurement(void);
void DebugPinsOff(void);
void Init_TIM1( void );
void Init_TIM2( void );
void TIM2_InitCapturePolarity(void);
void ComHandler(void);
void Commutate_Motor( void );
void StopMotor( void );
void BrakeMotor( void );
u8 BootStrap(void);
u8 AlignRotor( void );
void StartMotor( void );
void Init_ADC( void );
void Enable_ADC_BEMF_Sampling( void );
void Enable_ADC_Current_Sampling( void );
u16 CheckMaxDuty(u16 bRequested_Duty);
void DelayCoefAdjust(void);
u16 Set_Duty(u16 duty);
u16 Set_Current(u16 current);
void SetSamplingPoint_BEMF(void);
void SetSamplingPoint_Current(void);

#ifdef LS_GPIO_CONTROL
	void LS_GPIO_MANAGE(void);
	void LS_GPIO_OFF(void);
	void LS_GPIO_BRAKE(void);
	void LS_GPIO_BOOT(void);
	u8 LS_Conf;
#endif

/* Private Typedef */
typedef enum
{STARTUP_IDLE,STARTUP_BOOTSTRAP,STARTUP_ALIGN,STARTUP_START,STARTUP_RAMPING} StartUpStatus_t;

static StartUpStatus_t StartUpStatus = STARTUP_IDLE;

/* Private vars and define */
#define BIT0 0x01
#define BIT1 0x02
#define BIT2 0x04
#define BIT3 0x08
#define BIT4 0x10
#define BIT5 0x20
#define BIT6 0x40
#define BIT7 0x80

#define ARRTIM2 500

#define ARR_CURRENT_REF_TIM ARRTIM2

#define MILLIAMP_TOCNT(ma) (((((u32)ma * RS_M)/1000) * AOP * (u32)ARR_CURRENT_REF_TIM)/5000)
#define ADC_TOMILLIAMP(adc) ((((u32)adc * 1000 * 1000) / ((u32)1024 * AOP * RS_M)) * 5)

// Internal global pointer to Device and BLDC struct
pvdev_device_t g_pDevice = 0;
PBLDC_Struct_t g_pBLDC_Struct = 0;
static PBLDC_Var_t g_pMotorVar = 0;

u8 ADC_State;
#define ADC_SYNC	0x00
#define ADC_ASYNC	0x01

u8 ADC_Sync_State = 0x04;
#define ADC_BEMF_INIT					0x00
#define ADC_BEMF_SAMPLE				0x01
#define ADC_CURRENT_INIT			0x02
#define ADC_CURRENT_SAMPLE		0x03

#define SIZE_ADC_BUFFER 				2
#define ADC_CURRENT_INDEX				0
#define ADC_BUS_INDEX						1 // usato anche per il neutral point

u16 ADC_Buffer[ SIZE_ADC_BUFFER ];

static volatile u8 bCSR_Tmp; // Temporary storage of ADC channel selection

u16 hNeutralPoint;

#define NUMBER_PHASE_STEPS 6

#ifdef ETR_INPUT
	#define OCxCE_ENABLE BIT7
#else
	#define OCxCE_ENABLE 0
#endif

//select PWM mode 1, OC1 preload enabled, OCxCE enabled.
#define CCMR_PWM (OCxCE_ENABLE|BIT6|BIT5|BIT3)

//select PWM mode 2, OC1 preload enabled, OCxCE enabled. Low Side
#define CCMR_PWM_LS (OCxCE_ENABLE|BIT6|BIT5|BIT3)

//select OCREF - Forced Inactive, OC1 preload enabled (LS Off, HS On) X_COMP mode
#define CCMR_LOWSIDE (BIT6|BIT3)

//select OCREF - Forced Active, OC1 preload enabled (LS ON, HS Off) X_COMP mode
#define CCMR_HIGHSIDE (BIT6|BIT4|BIT3)

#if (PWM_U_LOW_SIDE_POLARITY == ACTIVE_LOW)
	#define PWM_POL_LS_A BIT3
#else
	#define PWM_POL_LS_A 0
#endif
#if (PWM_U_HIGH_SIDE_POLARITY == ACTIVE_LOW)
	#define PWM_POL_HS_A BIT1
#else
	#define PWM_POL_HS_A 0
#endif
#define PWM_POL_A PWM_POL_LS_A|PWM_POL_HS_A

#if (PWM_V_LOW_SIDE_POLARITY == ACTIVE_LOW)
	#define PWM_POL_LS_B BIT7
#else
	#define PWM_POL_LS_B 0
#endif
#if (PWM_V_HIGH_SIDE_POLARITY == ACTIVE_LOW)
	#define PWM_POL_HS_B BIT5
#else
	#define PWM_POL_HS_B 0
#endif
#define PWM_POL_B PWM_POL_LS_B|PWM_POL_HS_B

#if (PWM_W_LOW_SIDE_POLARITY == ACTIVE_LOW)
	#define PWM_POL_LS_C BIT3
#else
	#define PWM_POL_LS_C 0
#endif
#if (PWM_W_HIGH_SIDE_POLARITY == ACTIVE_LOW)
	#define PWM_POL_HS_C BIT1
#else
	#define PWM_POL_HS_C 0
#endif
#define PWM_POL_C PWM_POL_LS_C|PWM_POL_HS_C

#define A_ON  (BIT0|PWM_POL_A) // PWM mode on High Side
#define A_ON_LS  (BIT2|PWM_POL_A) // PWM mode on Low Side
#ifdef LS_GPIO_CONTROL
	#define A_COMP (PWM_POL_A)
#else
	#define A_COMP (BIT2|BIT0|PWM_POL_A)
#endif

#define A_OFF PWM_POL_A

#define B_ON (BIT4|PWM_POL_B)	// PWM mode on High Side
#define B_ON_LS (BIT6|PWM_POL_B) // PWM mode on Low Side
#ifdef LS_GPIO_CONTROL
	#define B_COMP (PWM_POL_B)
#else
	#define B_COMP (BIT6|BIT4|PWM_POL_B)
#endif

#define B_OFF PWM_POL_B

#define C_ON (BIT4|BIT0|PWM_POL_C) // PWM mode on High Side
#define C_ON_LS (BIT4|BIT2|PWM_POL_C) // PWM mode on Low Side
#ifdef LS_GPIO_CONTROL
	#define C_COMP (BIT4|PWM_POL_C)
#else
	#define C_COMP (BIT4|BIT2|BIT0|PWM_POL_C)
#endif

#define C_OFF (BIT4|PWM_POL_C)

// BRK settings
#ifdef BKIN
	#define DEV_BKIN TIM1_BREAK_ENABLE
#else
	#define DEV_BKIN TIM1_BREAK_DISABLE
#endif

#if (BKIN_POLARITY == ACTIVE_HIGH)
	#define DEV_BKIN_POLARITY            TIM1_BREAKPOLARITY_HIGH
#else
	#define DEV_BKIN_POLARITY            TIM1_BREAKPOLARITY_LOW
#endif

#define BEMF_RISING  1
#define BEMF_FALLING 0

#define SAMPLING_POINT_DURING_TOFF_CNT (u16)(((u32)SAMPLING_POINT_DURING_TOFF * STM8_FREQ_MHZ)/1000) // cnt before ARR
#define SAMPLING_POINT_DURING_TON_CNT (u16)(((u32)SAMPLING_POINT_DURING_TON * STM8_FREQ_MHZ)/1000) // cnt after ARR

u16 hDutyCntTh;
u16 hCntDeadDtime;

static const u16 hArrPwmVal = ((u16)((STM8_FREQ_MHZ * (u32)1000000)/PWM_FREQUENCY));
static const u16 hMaxDutyCnt = hArrPwmVal - (((u32)STM8_FREQ_MHZ * MINIMUM_OFF_TIME)/1000);

typedef struct 
{                 
	u8 CCMR_1; //Phase A 
	u8 CCMR_2; //Phase B
	u8 CCMR_3; //Phase C
	u8 CCER_1;
	u8 CCER_2;
} Phase_Step_s;

// CW Steps
//A-Channel1, B-Channel2, C-Channel3
//A(Hi), B(Lo), C-looking, BEMF Falling
//A(Hi), C(Lo), B-looking, BEMF Rising
//B(Hi), C(Lo), A-looking, BEMF Falling
//B(Hi), A(Lo), C-looking, BEMF Rising
//C(Hi), A(Lo), B-looking, BEMF Falling
//C(Hi), B(Lo), C-looking, BEMF Rising
const Phase_Step_s PhaseSteps_CW[ NUMBER_PHASE_STEPS ] =
{
	{CCMR_PWM, CCMR_LOWSIDE, CCMR_PWM, (A_ON|B_COMP),  C_OFF}, //A-HI, B-Lo, C-Looking
	{CCMR_PWM, CCMR_PWM, CCMR_LOWSIDE, (A_ON|B_OFF), C_COMP},  //A-HI, C-Lo, B-Looking
	{CCMR_PWM, CCMR_PWM, CCMR_LOWSIDE, (A_OFF|B_ON), C_COMP},  //B-HI, C-Lo, A-Looking
	{CCMR_LOWSIDE, CCMR_PWM, CCMR_PWM, (A_COMP|B_ON),  C_OFF}, //B-HI, A-Lo, C-Looking
	{CCMR_LOWSIDE, CCMR_PWM, CCMR_PWM, (A_COMP|B_OFF), C_ON},  //C-Hi, A-Lo, B-Looking
	{CCMR_PWM, CCMR_LOWSIDE, CCMR_PWM, (A_OFF|B_COMP), C_ON}   //C-Hi, B-Lo, A-Looking
};

const Phase_Step_s Fast_Demag_Steps_CW[ NUMBER_PHASE_STEPS ] =
{
	{CCMR_HIGHSIDE, CCMR_PWM_LS, CCMR_PWM, (A_COMP|B_ON_LS),  C_OFF}, //A-HI, B-Lo, C-Looking
	{CCMR_PWM, CCMR_PWM, CCMR_LOWSIDE, (A_ON|B_OFF), C_COMP},  //A-HI, C-Lo, B-Looking
	{CCMR_PWM, CCMR_HIGHSIDE, CCMR_PWM_LS, (A_OFF|B_COMP), C_ON_LS},  //B-HI, C-Lo, A-Looking
	{CCMR_LOWSIDE, CCMR_PWM, CCMR_PWM, (A_COMP|B_ON),  C_OFF}, //B-HI, A-Lo, C-Looking
	{CCMR_PWM_LS, CCMR_PWM, CCMR_HIGHSIDE, (A_ON_LS|B_OFF), C_COMP},  //C-Hi, A-Lo, B-Looking
	{CCMR_PWM, CCMR_LOWSIDE, CCMR_PWM, (A_OFF|B_COMP), C_ON}   //C-Hi, B-Lo, A-Looking
};

#ifdef LS_GPIO_CONTROL

	#define LS_A BIT0
	#define LS_B BIT1
	#define LS_C BIT2

	#define LS_NOSW	BIT0
	#define LS_A_B	BIT1
	#define LS_A_C	BIT2
	#define LS_B_A	BIT3
	#define LS_B_C	BIT4
	#define LS_C_A	BIT5
	#define LS_C_B	BIT6
	
	const u8 LS_Steps_CW[ NUMBER_PHASE_STEPS ] =
	{
		LS_B,
		LS_C,
		LS_C,
		LS_A,
		LS_A,
		LS_B
	};

	const u8 LS_Steps_SW_CW[ NUMBER_PHASE_STEPS ] =
	{
		LS_NOSW,
		LS_B_C,
		LS_NOSW,
		LS_C_A,
		LS_NOSW,
		LS_A_B
	};
	
	const u8 LS_Steps_CCW[ NUMBER_PHASE_STEPS ] =
	{
		LS_B,
		LS_B,
		LS_A,
		LS_A,
		LS_C,
		LS_C
	};

	const u8 LS_Steps_SW_CCW[ NUMBER_PHASE_STEPS ] =
	{
		LS_C_B,
		LS_NOSW,
		LS_B_A,
		LS_NOSW,
		LS_A_C,
		LS_NOSW
	};
	
