rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
	u8* LS_Steps = LS_Steps_CW;
	u8* LS_Steps_SW = LS_Steps_SW_CW;
#endif

Phase_Step_s* PhaseSteps = PhaseSteps_CW;
Phase_Step_s* Fast_Demag_Steps = Fast_Demag_Steps_CW;

// CCW Steps
//A-Channel1, B-Channel2, C-Channel3
//A(Hi), B(Lo), C-looking, BEMF Rising
//C(Hi), B(Lo), A-looking, BEMF Falling
//C(Hi), A(Lo), B-looking, BEMF Rising
//B(Hi), A(Lo), C-looking, BEMF Falling
//B(Hi), C(Lo), A-looking, BEMF Rising
//A(Hi), C(Lo), B-looking, BEMF Falling
const Phase_Step_s PhaseSteps_CCW[ NUMBER_PHASE_STEPS ] =
{
	{CCMR_PWM, CCMR_LOWSIDE, CCMR_PWM, (A_ON|B_COMP),  C_OFF}, //A-Hi, B-Lo, C-Looking
	{CCMR_PWM, CCMR_LOWSIDE, CCMR_PWM, (A_OFF|B_COMP), C_ON},  //C-Hi, B-Lo, A-Looking
	{CCMR_LOWSIDE, CCMR_PWM, CCMR_PWM, (A_COMP|B_OFF), C_ON},  //C-Hi, A-Lo, B-Looking
	{CCMR_LOWSIDE, CCMR_PWM, CCMR_PWM, (A_COMP|B_ON),  C_OFF}, //B-Hi, A-Lo, C-Looking
	{CCMR_PWM, CCMR_PWM, CCMR_LOWSIDE, (A_OFF|B_ON), C_COMP},  //B-Hi, C-Lo, A-Looking
	{CCMR_PWM, CCMR_PWM, CCMR_LOWSIDE, (A_ON|B_OFF), C_COMP}   //A-Hi, C-Lo, B-Looking
};

const Phase_Step_s Fast_Demag_Steps_CCW[ NUMBER_PHASE_STEPS ] =
{
	{CCMR_HIGHSIDE, CCMR_PWM_LS, CCMR_PWM, (A_COMP|B_ON_LS),  C_OFF},	//A-HI, B-Lo, C-Looking
	{CCMR_PWM, CCMR_LOWSIDE, CCMR_PWM, (A_OFF|B_COMP), C_ON},			//C-HI, B-Lo, A-Looking
	{CCMR_PWM_LS, CCMR_PWM, CCMR_HIGHSIDE, (A_ON_LS|B_OFF), C_COMP},	//C-HI, A-Lo, B-Looking
	{CCMR_LOWSIDE, CCMR_PWM, CCMR_PWM, (A_COMP|B_ON),  C_OFF}, 			//B-HI, A-Lo, C-Looking
	{CCMR_PWM, CCMR_HIGHSIDE, CCMR_PWM_LS, (A_OFF|B_COMP), C_ON_LS},	//B-Hi, C-Lo, A-Looking
	{CCMR_PWM, CCMR_PWM, CCMR_LOWSIDE, (A_ON|B_OFF), C_COMP} 			//A-Hi, C-Lo, B-Looking
};

typedef struct
{
	u8 BEMF_Level;
	u8 ADC_Channel;
} BEMF_Step_s;

// CW Steps
const BEMF_Step_s BEMFSteps_CW[ NUMBER_PHASE_STEPS ] =
{
	{BEMF_FALLING, PHASE_C_BEMF_ADC_CHAN},
	{BEMF_RISING,  PHASE_B_BEMF_ADC_CHAN},
	{BEMF_FALLING, PHASE_A_BEMF_ADC_CHAN},
	{BEMF_RISING,  PHASE_C_BEMF_ADC_CHAN},
	{BEMF_FALLING, PHASE_B_BEMF_ADC_CHAN},
	{BEMF_RISING,  PHASE_A_BEMF_ADC_CHAN}
};

BEMF_Step_s* BEMFSteps = BEMFSteps_CW;

// CCW Steps
const BEMF_Step_s BEMFSteps_CCW[ NUMBER_PHASE_STEPS ] =
{
	{BEMF_RISING, PHASE_C_BEMF_ADC_CHAN},
	{BEMF_FALLING,  PHASE_A_BEMF_ADC_CHAN},
	{BEMF_RISING, PHASE_B_BEMF_ADC_CHAN},
	{BEMF_FALLING,  PHASE_C_BEMF_ADC_CHAN},
	{BEMF_RISING, PHASE_A_BEMF_ADC_CHAN},
	{BEMF_FALLING,  PHASE_B_BEMF_ADC_CHAN}
};

u8 Current_Step;
u8 Current_BEMF;
u8 Current_BEMF_Channel;

u8 MTC_Status;
#define MTC_STEP_MODE         BIT0
#define MTC_STARTUP_FAILED    BIT1
#define MTC_OVER_CURRENT_FAIL BIT2
#define MTC_LAST_FORCED_STEP  BIT3
#define MTC_MOTOR_STALLED     BIT4

u8 Phase_State;
#define PHASE_COMM  0x00
#define PHASE_DEMAG 0x01
#define PHASE_ZERO  0x02

u16 Commutation_Time;
u16 Demag_Time;
u16 Zero_Cross_Time;
u16 Previous_Zero_Cross_Time;
u16 Average_Zero_Cross_Time;
u16 LastSwitchedCom;

u16 CurrentLimitCnt;

u8 Ramp_Step;

u8 Zero_Cross_Count;
u8 Last_Zero_Cross_Count;
#define MINIMUM_CONSECTIVE_ZERO_CROSS 12

u8 BEMF_Sample_Debounce;

u8 Z_Detection_Type;
#define Z_DETECT_PWM_OFF 0
#define Z_DETECT_PWM_ON  1

const u16 RAMP_TABLE[ STEP_RAMP_SIZE ] = 
{
	RAMP_VALUE0,
	RAMP_VALUE1,
	RAMP_VALUE2,
	RAMP_VALUE3,
	RAMP_VALUE4,
	RAMP_VALUE5,
	RAMP_VALUE6,
	RAMP_VALUE7,
	RAMP_VALUE8,
	RAMP_VALUE9,
	RAMP_VALUE10,
	RAMP_VALUE11,
	RAMP_VALUE12,
	RAMP_VALUE13,
	RAMP_VALUE14,
	RAMP_VALUE15,
	RAMP_VALUE16,
	RAMP_VALUE17,
	RAMP_VALUE18,
	RAMP_VALUE19,
	RAMP_VALUE20,
	RAMP_VALUE21,
	RAMP_VALUE22,
	RAMP_VALUE23,
	RAMP_VALUE24,
	RAMP_VALUE25,
	RAMP_VALUE26,
	RAMP_VALUE27,
	RAMP_VALUE28,
	RAMP_VALUE29,
	RAMP_VALUE30,
	RAMP_VALUE31,
	RAMP_VALUE32,
	RAMP_VALUE33,
	RAMP_VALUE34,
	RAMP_VALUE35,
	RAMP_VALUE36,
	RAMP_VALUE37,
	RAMP_VALUE38,
	RAMP_VALUE39,
	RAMP_VALUE40,
	RAMP_VALUE41,
	RAMP_VALUE42,
	RAMP_VALUE43,
	RAMP_VALUE44,
	RAMP_VALUE45,
	RAMP_VALUE46,
	RAMP_VALUE47,
	RAMP_VALUE48,
	RAMP_VALUE49,
	RAMP_VALUE50,
	RAMP_VALUE51,
	RAMP_VALUE52,
	RAMP_VALUE53,
	RAMP_VALUE54,
	RAMP_VALUE55,
	RAMP_VALUE56,
	RAMP_VALUE57,
	RAMP_VALUE58,
	RAMP_VALUE59,
	RAMP_VALUE60,
	RAMP_VALUE61,
	RAMP_VALUE62,
	RAMP_VALUE63
};

u8 Align_State;
#define ALIGN_IDLE 0x00
#define ALIGN_RAMP 0x01
#define ALIGN_DONE 0x02

#define ToCMPxH(CMP,Value)         ( CMP = (u8)((Value >> 8 ) & 0xFF))
#define ToCMPxL(CMP,Value)         ( CMP = (u8)(Value & 0xFF) )

u8 Align_Target;
u8 Align_Index;

#define CAP_STEP_NUM 6 // Do not change this value
u16 cap_val = 0;
u8 cap_index = 0;
u8 first_cap = 0;

u8 BEMF_Falling_Factor;
u8 BEMF_Rising_Factor;

#define BEMF_RISE_DELAY_FACTOR 128 // Strtup values
#define BEMF_FALL_DELAY_FACTOR 128

// BEMF voltage treshold
#define BEMF_RISING_THRESHOLD  (u16)((BEMF_RISING_THRESHOLD_V * 1024)/(EXPECTED_MCU_VOLTAGE))
#define BEMF_FALLING_THRESHOLD (u16)((BEMF_FALLING_THRESHOLD_V * 1024)/(EXPECTED_MCU_VOLTAGE))

u16 Zero_Sample_Count;
u16 Motor_Frequency;

u8 Motor_Stall_Count;
#define MOTOR_STALL_THRESHOLD 6

#define MAX_BUS_VOLTAGE16 (u16)((MAX_BUS_VOLTAGE*(u32)1024)/BUSV_CONVERSION)
#define MIN_BUS_VOLTAGE16 (u16)((MIN_BUS_VOLTAGE*(u32)1024)/BUSV_CONVERSION)
#define BRAKE_HYSTERESIS  (u16)((MAX_BUS_VOLTAGE16/16)*15)

u8 bComHanderEnable = 0;
u16 hTim3Cnt = 0,hTim3Th = 0;

static pu16 pcounter_reg;
static pu16 pDutyCycleCounts_reg;

u16 tmp_u16;
u8 tmp_u8;
u8 tmp_TIM1_CCMR1;
u8 tmp_TIM1_CCMR2;
u8 tmp_TIM1_CCMR3;
u8 tmp_TIM1_CCER1;
u8 tmp_TIM1_CCER2;

void dev_driveInit(pvdev_device_t pdevice)
{
	PBLDC_Struct_t pBLDC_Struct = Get_BLDC_Struct();
	g_pBLDC_Struct = pBLDC_Struct;
	g_pMotorVar = pBLDC_Struct->pBLDC_Var;
	g_pDevice = pdevice;

#if (BEMF_SAMPLING_METHOD == BEMF_SAMPLING_MIXED)
	hDutyCntTh = (u16)(((u32)hArrPwmVal*DUTY_CYCLE_TH_TON)/100);
#endif

	hCntDeadDtime = (u16)(((u32)g_pBLDC_Struct->pBLDC_Const->hDeadTime * STM8_FREQ_MHZ )/1000);

	// Current Limitation
	CurrentLimitCnt = (u16)(MILLIAMP_TOCNT (g_pBLDC_Struct->pBLDC_Const->hCurrent_Limitation));

	pcounter_reg = &(pdevice->regs.r16[VDEV_REG16_BEMF_COUNTS]);
	
	pDutyCycleCounts_reg = &(pdevice->regs.r16[VDEV_REG16_BLDC_DUTY_CYCLE_COUNTS]);

	Init_TIM1();
	Init_TIM2();
	Init_ADC();  
	
	#ifdef DEBUG_PINS
		DebugPinsOff();
	#endif
	
#if 1
    /* Initialise UART (115200bps) */
    if (uart_init(115200) != 0)
    {
        /* Error initialising UART */
    }
#endif

	#ifdef LS_GPIO_CONTROL

		//Init LS_GPIO_PORT
		LS_A_PORT->ODR &= (u8)(~LS_A_PIN);
		LS_A_PORT->DDR |= LS_A_PIN;
		LS_A_PORT->CR1 |= LS_A_PIN;
		LS_A_PORT->CR2 |= LS_A_PIN;
		LS_B_PORT->ODR &= (u8)(~LS_B_PIN);
		LS_B_PORT->DDR |= LS_B_PIN;
		LS_B_PORT->CR1 |= LS_B_PIN;
		LS_B_PORT->CR2 |= LS_B_PIN;
		LS_C_PORT->ODR &= (u8)(~LS_C_PIN);
		LS_C_PORT->DDR |= LS_C_PIN;
		LS_C_PORT->CR1 |= LS_C_PIN;
		LS_C_PORT->CR2 |= LS_C_PIN;

	#endif

	// faccio partire il timer che gestisce le acquisizioni
	// Application_ADC_Manager è la funzione che viene chiamata ad ogni timeout
	vtimer_SetTimer(ADC_SAMPLE_TIMER,ADC_SAMPLE_TIMEOUT,&Application_ADC_Manager);
}

MC_FuncRetVal_t dev_driveStartUpInit(void)
{
	// Set the correct Step table
	if (g_pBLDC_Struct->pBLDC_Var->hTarget_rotor_speed > 0)
	{
		BEMFSteps = BEMFSteps_CW;
		PhaseSteps = PhaseSteps_CW;
		Fast_Demag_Steps = Fast_Demag_Steps_CW;
		
		#ifdef LS_GPIO_CONTROL
			LS_Steps = LS_Steps_CW;
			LS_Steps_SW = LS_Steps_SW_CW;
		#endif
	}
	else
	{
		BEMFSteps = BEMFSteps_CCW;
		PhaseSteps = PhaseSteps_CCW;
		Fast_Demag_Steps = Fast_Demag_Steps_CCW;
		
		#ifdef LS_GPIO_CONTROL
			LS_Steps = LS_Steps_CCW;
			LS_Steps_SW = LS_Steps_SW_CCW;
		#endif		
	}

	StartUpStatus = STARTUP_BOOTSTRAP;
	vtimer_SetTimer(MTC_ALIGN_RAMP_TIMER,5,0);

	return FUNCTION_ENDED;
}

MC_FuncRetVal_t dev_driveStartUp(void)
{
	switch (StartUpStatus)
	{
	case STARTUP_IDLE:
		break;

	case STARTUP_BOOTSTRAP:
		if (BootStrap() == TRUE)
		{
			Align_State = ALIGN_IDLE;
			#ifdef DEBUG_PINS
				AUTO_SWITCH_PORT &= (u8)(~AUTO_SWITCH_PIN);
			#endif
			StartUpStatus = STARTUP_ALIGN;
			first_cap = 0;
		}
		break;

	case STARTUP_ALIGN:
		if( AlignRotor() )
		{
			StartUpStatus = STARTUP_START;
		}
		break;

	case STARTUP_START:
		MTC_Status |= MTC_STEP_MODE;
		MTC_Status &= (u8)(~(MTC_STARTUP_FAILED|MTC_OVER_CURRENT_FAIL|MTC_LAST_FORCED_STEP|MTC_MOTOR_STALLED));
		
