rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
		// Reset software threshold
		hTim3Th = 0;

		StartMotor();

		// Reset software counter
		hTim3Cnt = 0;

		// Enable update interrupt
		TIM1->IER |= BIT0;

		StartUpStatus = STARTUP_RAMPING;
		break;

	case STARTUP_RAMPING:
		if( (MTC_Status & MTC_STEP_MODE) == 0 )
		{
			vtimer_SetTimer(DEV_DUTY_UPDATE_TIMER,SPEED_PID_SAMPLING_TIME,&dev_BLDC_driveUpdate);
			StartUpStatus = STARTUP_IDLE;
			return FUNCTION_ENDED;
		}
		else
		{
			if( MTC_Status & (MTC_STARTUP_FAILED|MTC_OVER_CURRENT_FAIL) )
			{
				StartUpStatus = STARTUP_IDLE;
				dev_driveStop();
				return FUNCTION_ERROR;
			}
		}
		break;
	}
	return FUNCTION_RUNNING;
}

MC_FuncRetVal_t dev_driveRun(void)
{
	if( ((MTC_Status & MTC_OVER_CURRENT_FAIL) == MTC_OVER_CURRENT_FAIL) ||
		((MTC_Status & MTC_MOTOR_STALLED) == MTC_MOTOR_STALLED) )
	{
		dev_driveStop();
		return FUNCTION_ERROR;
	}
	return FUNCTION_RUNNING;
}

MC_FuncRetVal_t dev_driveStop(void)
{
	vtimer_KillTimer(DEV_DUTY_UPDATE_TIMER);
	StopMotor();
	#ifdef DEBUG_PINS
		DebugPinsOff();
	#endif
	*pcounter_reg = 0;

	// Check toggle mode
	if (g_pBLDC_Struct->pBLDC_Var->bToggleMode)
	{
		g_pBLDC_Struct->pBLDC_Var->hTarget_rotor_speed = -g_pBLDC_Struct->pBLDC_Var->hTarget_rotor_speed;
	}
	return FUNCTION_ENDED;
}

MC_FuncRetVal_t dev_driveWait(void)
{
	#ifdef ACTIVE_BRAKE
		static u8 st_tim = 0;
		if (st_tim == 0)
		{
			vtimer_SetTimer(MTC_ALIGN_RAMP_TIMER,BRAKE_DURATION,0);
			st_tim = 1;
			BrakeMotor();
		}
		if (vtimer_TimerElapsed(MTC_ALIGN_RAMP_TIMER))
		{
			st_tim = 0;
			StopMotor();
			return FUNCTION_ENDED;
		}
		else
		{
			return FUNCTION_RUNNING;
		}
	#else
		return FUNCTION_ENDED;
	#endif
}

void dev_BLDC_driveUpdate(void)
{
	vtimer_SetTimer(DEV_DUTY_UPDATE_TIMER,SPEED_PID_SAMPLING_TIME,&dev_BLDC_driveUpdate);
	#if (CURRENT_CONTROL_MODE == VOLTAGE_MODE)
		#if (SPEED_CONTROL_MODE == CLOSED_LOOP)
			g_pBLDC_Struct->pBLDC_Var->hDuty_cycle = Set_Duty(*pDutyCycleCounts_reg);
		#else
			Set_Duty(*pDutyCycleCounts_reg);
		#endif
	#endif
	#if (CURRENT_CONTROL_MODE == CURRENT_MODE)
		#if (SPEED_CONTROL_MODE == CLOSED_LOOP)
			g_pBLDC_Struct->pBLDC_Var->hCurrent_reference = Set_Current(*pDutyCycleCounts_reg);
		#else
			Set_Current(*pDutyCycleCounts_reg);
		#endif
	#endif
}


u16 tim1_step = 0;
extern State_t bState;

@near @interrupt @svlreg void TIM1_UPD_OVF_TRG_BRK_IRQHandler (void)
{
	#ifdef DEBUG_PINS
		static u16 bkin_blink_cnt = 0;
	#endif
	
	// ***********************************************************
	// ***********************************************************
	// ***********************************************************
	// da rimuovere !!!
	// solo per test adc
	// debug !!!
	if (bState == SM_DEBUG1 || bState == SM_DEBUG2)
	{
		if (tim1_step == 500)
		{
			GPIO_WriteReverse(GPIOD, GPIO_PIN_7);
			GPIO_WriteReverse(GPIOD, GPIO_PIN_2);
			GPIO_WriteReverse(GPIOD, GPIO_PIN_0);
			GPIO_WriteReverse(GPIOE, GPIO_PIN_0);
			tim1_step = 0;
		}
		else
			tim1_step++;
		
		TIM1->SR1 = (u8)(~(u8)TIM1_IT_UPDATE);
		
		return;
	}
	//ELSE
	
	
	
	
	
	
	if( (TIM1->SR1 & BIT7) == BIT7 )
	{
		TIM1->SR1 &= (u8)(~BIT7);
		
		#ifdef LS_GPIO_CONTROL
			// Disable low side			
			// Deactivate A
				LS_A_PORT->ODR &= (u8)(~LS_A_PIN);
			// Deactivate B
				LS_B_PORT->ODR &= (u8)(~LS_B_PIN);
			// Deactivate C
				LS_C_PORT->ODR &= (u8)(~LS_C_PIN);			
		#endif
		
		StartUpStatus = STARTUP_IDLE;

		g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_OCCURRED] |= OVER_CURRENT;
		#ifdef DEBUG_PINS
			DebugPinsOff();
			
			// If the BKIN is still active turn on the led to signal this condition
			if (((TIM1->SR1 & BIT7) == BIT7 ) && (bkin_blink_cnt <= 32768))
			{
				Z_DEBUG_PORT |= Z_DEBUG_PIN;
				C_D_DEBUG_PORT |= C_D_DEBUG_PIN;
				AUTO_SWITCH_PORT |= AUTO_SWITCH_PIN;
				PWM_ON_SW_PORT |= PWM_ON_SW_PIN;
			}
			bkin_blink_cnt++;
		#endif		
	} 
	else
	{
		// Update management only if BRK is not occurred
		if ((TIM1->SR1 & BIT0) == BIT0)
		{
			hTim3Cnt++;

			// Check for match
			if (hTim3Cnt >= hTim3Th)
			{
				ComHandler();
			}

			// Clear Flag
			TIM1->SR1 &= (u8)(~BIT0);
		}
	}
}

void Application_ADC_Manager( void )
{
	vtimer_SetTimer(ADC_SAMPLE_TIMER,ADC_SAMPLE_TIMEOUT,&Application_ADC_Manager);
	
	GetCurrent();
	GetBusVoltage(); // QUESTA SETTA ANCHE IL VALORE DEL NEUTRAL POINT	
}

void GetCurrent(void)
{
	u16 hVal;
	disableInterrupts();
	hVal = ADC_Buffer[ ADC_CURRENT_INDEX ];
	enableInterrupts();

	BLDC_Set_Current_measured((u16)(ADC_TOMILLIAMP(hVal)/100));
}

void GetBusVoltage( void )
{
	u16 data;
	
	disableInterrupts();
	data = ADC_Buffer[ ADC_BUS_INDEX ];
	enableInterrupts();
	
	if (data > MAX_BUS_VOLTAGE16)
	{
		#ifdef DISSIPATIVE_BRAKE
			#if (DISSIPATIVE_BRAKE_POL == DISSIPATIVE_BRAKE_ACTIVE_HIGH)
				DISSIPATIVE_BRAKE_PORT->ODR |= DISSIPATIVE_BRAKE_BIT;
			#else
				DISSIPATIVE_BRAKE_PORT->ODR &= (u8)(~DISSIPATIVE_BRAKE_BIT);
			#endif
		#else			
			g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_OCCURRED] |= BUS_OVERVOLTAGE;
			g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_ACTUAL] |= BUS_OVERVOLTAGE;
		#endif
	}
	if (data < BRAKE_HYSTERESIS)
	{
		#ifdef DISSIPATIVE_BRAKE
			#if (DISSIPATIVE_BRAKE_POL == DISSIPATIVE_BRAKE_ACTIVE_HIGH)
				DISSIPATIVE_BRAKE_PORT->ODR &= (u8)(~DISSIPATIVE_BRAKE_BIT);
			#else
				DISSIPATIVE_BRAKE_PORT->ODR |= DISSIPATIVE_BRAKE_BIT;
			#endif
		#else
			g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_ACTUAL] &= (u8)(~BUS_OVERVOLTAGE);
		#endif
	}
	if (data < MIN_BUS_VOLTAGE16)
	{
		g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_OCCURRED] |= BUS_UNDERVOLTAGE;
		g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_ACTUAL] |= BUS_UNDERVOLTAGE;      
	}
	else
	{
		g_pDevice->regs.r16[VDEV_REG16_HW_ERROR_ACTUAL] &= (u8)(~BUS_UNDERVOLTAGE);
	}    
		
	g_pDevice->regs.r16[VDEV_REG16_BOARD_BUS_VOLTAGE] = data;

	BLDC_Set_Bus_Voltage((u16)((data * BUSV_CONVERSION) / 1024));
	
	hNeutralPoint = data; // *** SETTO IL VALORE DEL NEUTRAL POINT ***
}

void Init_ADC( void )
{
	u8 value;
	u16 ADC_TDR_tmp;

	ADC_Sync_State = ADC_CURRENT_INIT;
	ADC_State = ADC_SYNC;

	ADC1->CSR = 0; 
	
	//select 4MHz clock based on 16MHz fMaster (div4), single mode
	//       6MHz clock based on 24MHz fMaster (div4)
	ADC1->CR1 = BIT5;

	//select internal trigger TIM1 TRGO
	ADC1->CR2 = 0;

	//select phase input
	ADC1->CSR = PHASE_C_BEMF_ADC_CHAN;

	ADC_TDR_tmp = 0;
	ADC_TDR_tmp |= (u16)(1) << PHASE_A_BEMF_ADC_CHAN;
	ADC_TDR_tmp |= (u16)(1) << PHASE_B_BEMF_ADC_CHAN;
	ADC_TDR_tmp |= (u16)(1) << PHASE_C_BEMF_ADC_CHAN;

	ADC_TDR_tmp |= (u16)(1) << ADC_CURRENT_CHANNEL;
	ADC_TDR_tmp |= (u16)(1) << ADC_BUS_CHANNEL;
	
	ToCMPxH( ADC1->TDRH, ADC_TDR_tmp);
	ToCMPxL( ADC1->TDRL, ADC_TDR_tmp);
	
	//enable trigger
	ADC1->CR2 |= BIT6;

	//enable ADC
	ADC1->CR1 |= BIT0;
	//allow ADC to stabilize
	value=30;
	while(value--);                    
	//clear interrupt flag
	ADC1->CSR &= (u8)(~BIT7);
	ADC1->CSR |= BIT5;
}

void Enable_ADC_BEMF_Sampling( void )
{
	//Enable sampling of BEMF
	ADC_Sync_State = ADC_BEMF_INIT;
}

void Enable_ADC_Current_Sampling( void )
{
	//Enable sampling of the current
	ADC_Sync_State = ADC_CURRENT_INIT;
}

// This function capture the time into the Zero_Cross_Time vars
// express in number of PWM period occured from the last capture
void GetStepTime(void)
{
	u16 cur_time;

