rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
	cur_time = hTim3Cnt;
	// Reset counter
	hTim3Cnt = 0;

	Zero_Cross_Time = cur_time;
	Zero_Cross_Count++;
}

// This function manage the speed measurement using a buffer
void SpeedMeasurement(void)
{
	if (first_cap == 0)
	{
		first_cap = 1;
		cap_val = 0;
		cap_index = 0;
	}
	else
	{
		cap_val += Zero_Cross_Time;
		cap_index++;
		
		if (cap_index == CAP_STEP_NUM)
		{
			*pcounter_reg = cap_val;
			cap_val = 0;
			cap_index = 0;
		}
	}
}

@near @interrupt @svlreg void ADC2_IRQHandler (void)
{
	if (bState == SM_DEBUG1 || bState == SM_DEBUG2)
	{
		ADC_Buffer[ADC_BUS_INDEX] = ADC1_GetConversionValue();
		ADC1_ClearFlag(ADC1_FLAG_EOC); // SW Clear the EOC flag to get the ADC ready for the next start conversion command
		ADC1_StartConversion();
		return;
		
		if (1)
		{
			u8 temp_AD_H;
			u8 temp_AD_L;
			
			temp_AD_H = ADC1->DRH;	    // read conversion result (MSB first!)
			temp_AD_L = ADC1->DRL;	    // and store it to AD samples field
			
			ADC_Buffer[ADC_BUS_INDEX] = ((u16)(temp_AD_H) << 2) | (temp_AD_L & 3);
			
			ADC1->CSR &= ~ADC1_CSR_EOC;		// clear end of conversion flag
			ADC1->CR1 |=  ADC1_CR1_ADON;	// Wake-up/trigg the ADC 
			
			return;
		}
	}
	//ELSE
	
	
	if (ADC_State == ADC_SYNC)
	{
		// Syncronous sampling
		
		u16 data;
		u8 delay;
		u16 bemf_threshold;

		// Reset bit
		bComHanderEnable = 0;
			
		//clear interrupt flag
		ADC1->CSR &= (u8)(~BIT7);
				
		//left align - read DRH first
		data = ADC1->DRH;
		data <<= 2;
		data |= (ADC1->DRL & 0x03);   
		
		switch (ADC_Sync_State)
		{
			case ADC_BEMF_INIT:
				ADC1->CSR = (u8)((Current_BEMF_Channel|BIT5)); 
				BEMF_Sample_Debounce = 0;
				Zero_Sample_Count = 0;
				ADC_Sync_State = ADC_BEMF_SAMPLE;
				SetSamplingPoint_BEMF();
				break;

			case ADC_BEMF_SAMPLE: 
				//detect zero crossing 
				if (Current_BEMF == BEMF_FALLING)
				{
					if (Z_Detection_Type == Z_DETECT_PWM_OFF)
					{
						bemf_threshold = BEMF_FALLING_THRESHOLD;
					}
					else
					{
						bemf_threshold = hNeutralPoint;
					}

					if (Ramp_Step > FORCED_STATUP_STEPS)
					{
						if (data < bemf_threshold)
						{
							Zero_Sample_Count++;
							BEMF_Sample_Debounce++;
							if (BEMF_Sample_Debounce >= BEMF_SAMPLE_COUNT)
							{
								hTim3Th -= hTim3Cnt;
								GetStepTime();

								#ifdef DEBUG_PINS
									Z_DEBUG_PORT ^= Z_DEBUG_PIN;
								#endif
 
								SpeedMeasurement();

								bComHanderEnable = 1;

								BEMF_Sample_Debounce = 0;
							}
						}
						else
						{
							BEMF_Sample_Debounce = 0;
						}
					}
				}
				else /* if (Current_BEMF != BEMF_FALLING) */
				{
					if (Z_Detection_Type == Z_DETECT_PWM_OFF)
					{
						bemf_threshold = BEMF_RISING_THRESHOLD;
					}
					else
					{
						bemf_threshold = hNeutralPoint;
					}
	
					if (Ramp_Step > FORCED_STATUP_STEPS)
					{
						if (data > bemf_threshold)
						{
							Zero_Sample_Count++;
							BEMF_Sample_Debounce++;
							if (BEMF_Sample_Debounce >= BEMF_SAMPLE_COUNT)
							{
								hTim3Th -= hTim3Cnt;
								GetStepTime();
							
								#ifdef DEBUG_PINS
									Z_DEBUG_PORT ^= Z_DEBUG_PIN;
								#endif

								SpeedMeasurement();

								bComHanderEnable = 1;

								BEMF_Sample_Debounce = 0;
							}
						}
						else
						{
							BEMF_Sample_Debounce = 0;
						}
					}
				}
				break;

			default:
			case ADC_CURRENT_INIT:
				ADC1->CSR = (ADC_CURRENT_CHANNEL|BIT5); 
				ADC_Sync_State = ADC_CURRENT_SAMPLE;
				SetSamplingPoint_Current();
				break;
			
			case ADC_CURRENT_SAMPLE: 
				ADC_Buffer[ADC_CURRENT_INDEX] = data;
				break;
		}

		// Store the current channel selected
		bCSR_Tmp = ADC1->CSR;

		// **************************************
		// *** Set the Async sampling channel ***
		// **************************************
		// la prossima conversione sarà di tipo asincrono
		// vado a leggere la tensione della batteria
		ADC1->CSR = (ADC_BUS_CHANNEL|BIT5); 
		
		// **********************************
		// *** Start asyncronous sampling ***
		// **********************************
		#ifdef DEV_CUT_1
			// Disable ext. trigger
			ADC1->CR2 &= (u8)(~BIT6);
			//turn on ADC fix bug on cut1 device
			ADC1->CR1 |= BIT0;
			//Start ADC sample
			ADC1->CR1 |= BIT0;
		#else
			// Disable ext. trigger
			ADC1->CR2 &= (u8)(~BIT6);
			//Start ADC sample
			ADC1->CR1 |= BIT0;
		#endif

		ADC_State = ADC_ASYNC;
		
		if (bComHanderEnable == 1)
		{
			ComHandler();
		}
	}
	else /* if (ADC_State == ADC_ASYNC) */
	{
		// Asyncronous sampling
		
		u16 data;			
		data = ADC1->DRH;
		data <<= 2;
		data |= (ADC1->DRL & 0x03);

		//clear interrupt flag
		ADC1->CSR &= (u8)(~BIT7);

		// Restore the sync ADC channel
		ADC1->CSR = bCSR_Tmp;
					
		// Configure syncronous sampling
		#ifdef DEV_CUT_1
			// Enable ext. trigger
			ADC1->CR2 |= BIT6;
			//turn on ADC fix bug on cut1 device
			ADC1->CR1 |= BIT0;  
		#else
			// Enable ext. trigger
			ADC1->CR2 |= BIT6;
		#endif

		// Manage async sampling
		ADC_Buffer[ADC_BUS_INDEX] = data;
		
		ADC_State = ADC_SYNC;			
	}
}

void DebugPinsOff(void)
{
#ifdef DEBUG_PINS
	// prima li metto a 1 per vedere se vanno ...
	Z_DEBUG_PORT 			|= (u8)(Z_DEBUG_PIN);
	C_D_DEBUG_PORT 		|= (u8)(C_D_DEBUG_PIN);
	AUTO_SWITCH_PORT 	|= (u8)(AUTO_SWITCH_PIN);
	PWM_ON_SW_PORT 		|= (u8)(PWM_ON_SW_PIN);
	
	// poi qui li spengo
	Z_DEBUG_PORT 			&= (u8)(~Z_DEBUG_PIN);
	C_D_DEBUG_PORT 		&= (u8)(~C_D_DEBUG_PIN);
	AUTO_SWITCH_PORT 	&= (u8)(~AUTO_SWITCH_PIN);
	PWM_ON_SW_PORT 		&= (u8)(~PWM_ON_SW_PIN);
#endif
}

//Timer1 used for main motor PWM outputs and for triggering the ADC sample
//channels 1,2, and 3 are used.  Channel 4 is available
void Init_TIM1(void)
{
	//counter disabled, ARR preload register disabled, up counting, edge aligned mode
	// dal manuale: 
	// When enabled by the UDIS bit, the UIF bit is set 
	// and an update interrupt request is sent only when 
	// registers are updated (counter overflow/underflow)
	TIM1->CR1 = BIT2;

	//Master Mode=TRGO-OC4REF,COMS only on COMG set, Preload CCxE, CCxNE, and OCxM bits
	TIM1->CR2 = (BIT6|BIT5|BIT4|BIT0);

