rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
	//slave mode disabled
	TIM1->SMCR = 0;

	#ifdef ETR_INPUT
		//Set external trigger filter
		TIM1->ETR = CURRENT_FILTER;
	#endif

	//disable all interrupts
	TIM1->IER = 0;

	TIM1->CCER1 = 0;
	TIM1->CCER2 = 0;

	//select PWM mode 1, OC1 preload enabled
	TIM1->CCMR1 = CCMR_PWM;
	//select PWM mode 1, OC2 preload enabled
	TIM1->CCMR2 = CCMR_PWM;
	//select PWM mode 1, OC3 preload enabled
	TIM1->CCMR3 = CCMR_PWM;

	//select PWM mode 2, 
	TIM1->CCMR4 = BIT6|BIT5|BIT4|BIT3;

	//prescale = div1 @ 16MHz -> 62.5ns/count, Full scale = 4.09ms 
	TIM1->PSCRH = 0; 
	TIM1->PSCRL = 0;

	ToCMPxH( TIM1->ARRH, hArrPwmVal );
	ToCMPxL( TIM1->ARRL, hArrPwmVal );

	//disable repetition counter
	TIM1->RCR = 0;

	//default to 0% duty cycle
	ToCMPxH( TIM1->CCR1H, 0 );
	ToCMPxL( TIM1->CCR1L, 0 );
	//default to 0% duty cycle
	ToCMPxH( TIM1->CCR2H, 0 );
	ToCMPxL( TIM1->CCR2L, 0 );
	//default to 0% duty cycle
	ToCMPxH( TIM1->CCR3H, 0 );
	ToCMPxL( TIM1->CCR3L, 0 );

	ToCMPxH( TIM1->CCR4H, (hArrPwmVal-SAMPLING_POINT_DURING_TOFF_CNT) );
	ToCMPxL( TIM1->CCR4L, (hArrPwmVal-SAMPLING_POINT_DURING_TOFF_CNT) );
	
	//set dead time to 6us (with 62.5ns/count)
	TIM1->DTR = (u8)(hCntDeadDtime); 

	// Setup IDLE State 
	TIM1->OISR  = 0; // Default inactive 
	
	/* Set the Output Idle state & the Output N Idle state configuration */
	#if (PWM_U_HIGH_SIDE_IDLE_STATE == ACTIVE)
		TIM1->OISR |= (u8)(TIM1_OISR_OIS1);
	#endif
	#if (PWM_U_LOW_SIDE_IDLE_STATE == ACTIVE)
		TIM1->OISR |= (u8)(TIM1_OISR_OIS1N);
	#endif
	#if (PWM_V_HIGH_SIDE_IDLE_STATE ==  ACTIVE)
		TIM1->OISR |= (u8)(TIM1_OISR_OIS2);
	#endif
	#if (PWM_V_LOW_SIDE_IDLE_STATE == ACTIVE)
		TIM1->OISR |= (u8)(TIM1_OISR_OIS2N);
	#endif
	#if (PWM_W_HIGH_SIDE_IDLE_STATE ==  ACTIVE)
		TIM1->OISR |= (u8)(TIM1_OISR_OIS3);
	#endif
	#if (PWM_W_LOW_SIDE_IDLE_STATE == ACTIVE)
		TIM1->OISR |= (u8)(TIM1_OISR_OIS3N);
	#endif

	//disable channel outputs
	TIM1->CCER1 = (A_OFF|B_OFF);
	//disable channel outputs
	TIM1->CCER2 = C_OFF;
	
	//enable main outputs, enable break, OSSR=1, OSSI=1, LOCKLEVEL 2, Break Polarity
	#define TIM1_OSSRSTATE_ENABLE BIT3
	#ifndef LS_GPIO_CONTROL
		TIM1->BKR = (DEV_BKIN_POLARITY|DEV_BKIN|TIM1_OSSRSTATE_ENABLE|TIM1_OSSISTATE_ENABLE|TIM1_LOCKLEVEL_2); 
	#else
		// If GPIO is used to drive low side then the disabled outputs of the timer
		// must be not driven by the timer during run time (MOE = 1)
		TIM1->BKR = (DEV_BKIN_POLARITY|DEV_BKIN|TIM1_OSSISTATE_ENABLE|TIM1_LOCKLEVEL_2); 
	#endif

	//counter enabled
	TIM1->CR1 |= BIT0;

	//force timer update
	TIM1->EGR = (BIT5|BIT0);

	//enable break interrupt
	TIM1->IER = BIT7;

	#ifdef ETR_INPUT
		//Enable ETR pin
		GPIO_Init(ETR_PORT, ETR_PIN,GPIO_MODE_IN_FL_NO_IT);
	#endif
}

void Init_TIM2(void)
{
	//counter disabled, ARR preload register disabled, up counting, edge aligned mode
	TIM2->CR1 = BIT2;

	//disable all interrupts
	TIM2->IER = 0;

	TIM2->CCER1 = 0;
	TIM2->CCER2 = 0;

	//select PWM mode 2, OC2 preload enabled
	TIM2->CCMR2 = BIT6|BIT5|BIT3;

	//prescale = div3 @ 16MHz -> 0.5us/count * 24MHz -> 0.33us/count
	TIM2->PSCR = 0; 

	ToCMPxH( TIM2->ARRH, ARRTIM2 );
	ToCMPxL( TIM2->ARRL, ARRTIM2 );

	// Current Limitation
	ToCMPxH( TIM2->CCR2H, MILLIAMP_TOCNT (STARTUP_CURRENT_LIMITATION) );
	ToCMPxL( TIM2->CCR2L, MILLIAMP_TOCNT (STARTUP_CURRENT_LIMITATION) );		 

	//Enable output
	TIM2->CCER1 |= BIT4;

	//counter enabled
	TIM2->CR1 |= BIT0;

	//force timer update
	TIM2->EGR = (BIT5|BIT0);
}

void ComHandler(void)
{
	u16 cur_time;
	u16 temp_time;
	u8 i;

	switch( Phase_State )
	{
	case PHASE_COMM:
		#ifdef DEBUG_PINS
			C_D_DEBUG_PORT |= C_D_DEBUG_PIN;
		#endif
		Commutate_Motor();
		Phase_State = PHASE_DEMAG; 
		Enable_ADC_Current_Sampling();
	break;

	case PHASE_DEMAG:
		#ifdef DEBUG_PINS
			C_D_DEBUG_PORT &= (u8)(~C_D_DEBUG_PIN);
		#endif
		if( (MTC_Status & MTC_STEP_MODE) == MTC_STEP_MODE )
		{
			//load commutation time from ramp table
			Commutation_Time = RAMP_TABLE[ Ramp_Step ];
			if( Ramp_Step < STEP_RAMP_SIZE )
			{
				Ramp_Step++;
			}
			else
			{
				MTC_Status |= MTC_STARTUP_FAILED;                  
			}

			//load commutation time into timer
			hTim3Th = LastSwitchedCom + Commutation_Time;
		}
		else
		{
			//load fail safe commutation time in case zero cross not detected (2 zero crossing time)
			temp_time = Previous_Zero_Cross_Time * 2;
			hTim3Th = hTim3Cnt + temp_time;
		}

		//commutate the motor
		TIM1->EGR |= BIT5;

		// Update CCMRx OCxCE bit (Actual)
		TIM1->CCMR1 = (u8)(PhaseSteps[Current_Step].CCMR_1 & 0x80);
		TIM1->CCMR2 = (u8)(PhaseSteps[Current_Step].CCMR_2 & 0x80);
		TIM1->CCMR3 = (u8)(PhaseSteps[Current_Step].CCMR_3 & 0x80);

		//preload next step
		Current_Step++;
		if( Current_Step >= NUMBER_PHASE_STEPS )
		{
			Current_Step = 0;
		}
	
		if (g_pBLDC_Struct->pBLDC_Var->bFastDemag == 1)
		{
			// Set fast demag
			TIM1->CCMR1 |= (u8)(Fast_Demag_Steps[Current_Step].CCMR_1 & 0x7F);
			TIM1->CCMR2 |= (u8)(Fast_Demag_Steps[Current_Step].CCMR_2 & 0x7F);
			TIM1->CCMR3 |= (u8)(Fast_Demag_Steps[Current_Step].CCMR_3 & 0x7F);
			tmp_TIM1_CCER1 = Fast_Demag_Steps[Current_Step].CCER_1;
			tmp_TIM1_CCER2 = Fast_Demag_Steps[Current_Step].CCER_2;
		}
		else
		{
			// Set fast demag
			TIM1->CCMR1 |= (u8)(PhaseSteps[Current_Step].CCMR_1 & 0x7F);
			TIM1->CCMR2 |= (u8)(PhaseSteps[Current_Step].CCMR_2 & 0x7F);
			TIM1->CCMR3 |= (u8)(PhaseSteps[Current_Step].CCMR_3 & 0x7F);
			tmp_TIM1_CCER1 = PhaseSteps[Current_Step].CCER_1;
			tmp_TIM1_CCER2 = PhaseSteps[Current_Step].CCER_2;
		}

		// Store the values
		tmp_TIM1_CCMR1 = TIM1->CCMR1;
		tmp_TIM1_CCMR2 = TIM1->CCMR2;
		tmp_TIM1_CCMR3 = TIM1->CCMR3;

		// Set to frozen for next COM
		TIM1->CCMR1 &= 0x8F;
		TIM1->CCMR2 &= 0x8F;
		TIM1->CCMR3 &= 0x8F;

		Enable_ADC_BEMF_Sampling();
		Phase_State = PHASE_ZERO; 
		break;

	case PHASE_ZERO:
		Enable_ADC_Current_Sampling();
		if( Zero_Cross_Count != Last_Zero_Cross_Count )
		{
			if( (MTC_Status & MTC_STEP_MODE) != MTC_STEP_MODE )
			{
				// Autoswitch mode
				
