rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
				//adjust commutation time based on motor speed

				if( Current_BEMF == BEMF_FALLING )
				{
					#asm
						; Commutation_Time = (Previous_Zero_Cross_Time * BEMF_Falling_Factor) >> 8;
						
						ld A,_Previous_Zero_Cross_Time
						ld XL,A
						ld A,_BEMF_Falling_Factor
						mul X,A
						ldw _Commutation_Time,X
						ld A,_Previous_Zero_Cross_Time + 1
						ld XL,A
						ld A,_BEMF_Falling_Factor
						mul X,A
						ld A,XH
						clrw X
						ld XL,A
						addw X,_Commutation_Time
						ldw _Commutation_Time,X
					#endasm
				}
				else
				{
					Motor_Stall_Count = 0;
					#asm
						; Commutation_Time = (Previous_Zero_Cross_Time * BEMF_Rising_Factor) >> 8;
						
						ld A,_Previous_Zero_Cross_Time
						ld XL,A
						ld A,_BEMF_Rising_Factor
						mul X,A
						ldw _Commutation_Time,X
						ld A,_Previous_Zero_Cross_Time + 1
						ld XL,A
						ld A,_BEMF_Rising_Factor
						mul X,A
						ld A,XH
						clrw X
						ld XL,A
						addw X,_Commutation_Time
						ldw _Commutation_Time,X
					#endasm
				}

				if( Zero_Sample_Count == 1 )
				{                                      

					Commutation_Time >>= 1;
				}
				
				hTim3Th = Commutation_Time;
			}
			else
			{
				//if number of consectutive BEMF events occurred, switch out of stepped mode
				if( Zero_Cross_Count >= MINIMUM_CONSECTIVE_ZERO_CROSS )
				{
					MTC_Status |= MTC_LAST_FORCED_STEP;
					Motor_Stall_Count = 0;
					Commutation_Time = Average_Zero_Cross_Time;
					
					hTim3Th = Average_Zero_Cross_Time;
	
					//load commutation time into timer
					Previous_Zero_Cross_Time = Commutation_Time;
					Zero_Cross_Time = Commutation_Time;
				}
			}
			
			Average_Zero_Cross_Time = (Previous_Zero_Cross_Time + Zero_Cross_Time) >> 1;
			Previous_Zero_Cross_Time = Zero_Cross_Time;
			Phase_State = PHASE_COMM; 
		}
		else
		{
			//if zero crossing not detected - commutate motor
			if( (MTC_Status & MTC_STEP_MODE) != MTC_STEP_MODE )
			{
				if( Current_BEMF == BEMF_RISING )
				{
					if( Motor_Stall_Count < MOTOR_STALL_THRESHOLD )
					{
						Motor_Stall_Count++;
					}
					else
					{
						MTC_Status |= MTC_MOTOR_STALLED;
					}
				}
			}  
			#ifdef DEBUG_PINS
				C_D_DEBUG_PORT |= C_D_DEBUG_PIN;
			#endif
			Commutate_Motor();
			Zero_Cross_Count=0;
			Phase_State = PHASE_DEMAG; 
		}
		Last_Zero_Cross_Count = Zero_Cross_Count;
		break;

	default:
		Phase_State = PHASE_COMM; 
		break;
	}
}
	
void Commutate_Motor( void )
{
	u16 cur_time;

	cur_time = hTim3Cnt;

	// Switch to Frozen
	TIM1->EGR |= BIT5;

	// Restore Values
	TIM1->CCMR1 = tmp_TIM1_CCMR1;
	TIM1->CCMR2 = tmp_TIM1_CCMR2;
	TIM1->CCMR3 = tmp_TIM1_CCMR3;
	TIM1->CCER1 = tmp_TIM1_CCER1;
	TIM1->CCER2 = tmp_TIM1_CCER2;

	//commutate the motor
	TIM1->EGR |= BIT5;
	
	#ifdef LS_GPIO_CONTROL
	{
		LS_Conf = LS_Steps_SW[Current_Step];

		if (LS_Conf == LS_A_B)
		{
			// Activate   B
			LS_B_PORT->ODR |= LS_B_PIN;
			// Deactivate A
			LS_A_PORT->ODR &= (u8)(~LS_A_PIN);			
		}
		
		if (LS_Conf == LS_A_C)
		{
			// Activate   C
			LS_C_PORT->ODR |= LS_C_PIN;
			// Deactivate A
			LS_A_PORT->ODR &= (u8)(~LS_A_PIN);			
		}

		if (LS_Conf == LS_B_A)
		{
			// Activate   A
			LS_A_PORT->ODR |= LS_A_PIN;
			// Deactivate B
			LS_B_PORT->ODR &= (u8)(~LS_B_PIN);			
		}

		if (LS_Conf == LS_B_C)
		{
			// Activate   C
			LS_C_PORT->ODR |= LS_C_PIN;
			// Deactivate B
			LS_B_PORT->ODR &= (u8)(~LS_B_PIN);			
		}

		if (LS_Conf == LS_C_A)
		{
			// Activate   A
			LS_A_PORT->ODR |= LS_A_PIN;
			// Deactivate C
			LS_C_PORT->ODR &= (u8)(~LS_C_PIN);			
		}

		if (LS_Conf == LS_C_B)
		{
			// Activate   B
			LS_B_PORT->ODR |= LS_B_PIN;
			// Deactivate C
			LS_C_PORT->ODR &= (u8)(~LS_C_PIN);			
		}
	}
	#endif
	
	Current_BEMF = BEMFSteps[Current_Step].BEMF_Level;
	Current_BEMF_Channel = BEMFSteps[Current_Step].ADC_Channel;

	if (g_pBLDC_Struct->pBLDC_Var->bFastDemag == 0)
	{
		// Update CCMRx OCxCE bit (Actual)
		TIM1->CCMR1 = (u8)(PhaseSteps[Current_Step].CCMR_1 & 0x80);
		TIM1->CCMR2 = (u8)(PhaseSteps[Current_Step].CCMR_2 & 0x80);
		TIM1->CCMR3 = (u8)(PhaseSteps[Current_Step].CCMR_3 & 0x80);
	}
	else
	{
		// Update CCMRx OCxCE bit (Actual)
		TIM1->CCMR1 = (u8)(Fast_Demag_Steps[Current_Step].CCMR_1 & 0x80);
		TIM1->CCMR2 = (u8)(Fast_Demag_Steps[Current_Step].CCMR_2 & 0x80);
		TIM1->CCMR3 = (u8)(Fast_Demag_Steps[Current_Step].CCMR_3 & 0x80);
	}

	// Preload next values
	TIM1->CCMR1 |= (u8)(PhaseSteps[Current_Step].CCMR_1 & 0x7F);
	TIM1->CCMR2 |= (u8)(PhaseSteps[Current_Step].CCMR_2 & 0x7F);
	TIM1->CCMR3 |= (u8)(PhaseSteps[Current_Step].CCMR_3 & 0x7F);
	TIM1->CCER1 = PhaseSteps[Current_Step].CCER_1;
	TIM1->CCER2 = PhaseSteps[Current_Step].CCER_2;

	//calc demag time
	if( (MTC_Status & MTC_STEP_MODE) == MTC_STEP_MODE )
	{
		if( (MTC_Status & MTC_LAST_FORCED_STEP) == MTC_LAST_FORCED_STEP )
		{
			MTC_Status &= (u8)(~MTC_STEP_MODE);
			#ifdef DEBUG_PINS
				AUTO_SWITCH_PORT |= AUTO_SWITCH_PIN;
			#endif
		}
		
		//Demag_Time = (u16)((u32)(Commutation_Time * BLDC_Get_Demag_Time()) / 100);
		tmp_u8 = BLDC_Get_Demag_Time();
		#asm
			; tmp_sc_u8 = (u8)((tmp_u8 * 256) / (u8)(100));
			
			ld A,_tmp_u8
			clrw x
			ld XH,A
			ld A,#0x64
			div X,A
			
			ld A,XL
			ld _tmp_u8,A
		
			; Demag_Time = (Commutation_Time * tmp_sc_u8) >> 8;
			
			ld A,_Commutation_Time
			ld XL,A
			ld A,_tmp_u8
			mul X,A
			ldw _tmp_u16,X
			ld A,_Commutation_Time + 1
			ld XL,A
			ld A,_tmp_u8
			mul X,A
			ld A,XH
			clrw X
			ld XL,A
			addw X,_tmp_u16
			ldw _Demag_Time,X
		#endasm
	}
	else
	{		
		//Demag_Time = (u16)((u32)(Average_Zero_Cross_Time * BLDC_Get_Demag_Time()) / 100);
		tmp_u8 = BLDC_Get_Demag_Time();
		#asm
			; tmp_sc_u8 = (u8)((BLDC_Get_Demag_Time() * 256) / (u8)(100));
			
			ld A,_tmp_u8
			clrw x
			ld XH,A
			ld A,#0x64
			div X,A
			
