rashvand/brush-v1/STM8-MC_KIT/STM8_MC_FRAMEWORK/src/MC_stm8s_BLDC_drive.c
	temp = current;

	// Current Limitation
	current = (u16)(MILLIAMP_TOCNT (current));

	if (current > CurrentLimitCnt)
		current = CurrentLimitCnt;

	// Current Limitation
	ToCMPxH( TIM2->CCR2H, current );
	ToCMPxL( TIM2->CCR2L, current );

	return temp;
} 

void SetSamplingPoint_BEMF(void)
{
	#if (BEMF_SAMPLING_METHOD == BEMF_SAMPLING_MIXED)
		if( *pDutyCycleCounts_reg  < hDutyCntTh )
		{
			#ifdef DEBUG_PINS
				// Info PINS
				PWM_ON_SW_PORT &= (u8)(~PWM_ON_SW_PIN);
			#endif

			Z_Detection_Type = Z_DETECT_PWM_OFF;
			//make control lines floating Input.
			MCI_CONTROL_DDR &= (u8)(~MCI_CONTROL_PINS);

			//set sample point xx us before Ton - during PWM-Off time
			ToCMPxH( TIM1->CCR4H, (hArrPwmVal-SAMPLING_POINT_DURING_TOFF_CNT) );
			ToCMPxL( TIM1->CCR4L, (hArrPwmVal-SAMPLING_POINT_DURING_TOFF_CNT) );
		}
		else
		{
			#ifdef DEBUG_PINS
				// Info PINS
				PWM_ON_SW_PORT |= PWM_ON_SW_PIN;
			#endif
			Z_Detection_Type = Z_DETECT_PWM_ON;
			//Make control line (P-P) output low
			MCI_CONTROL_DR &= (u8)(~MCI_CONTROL_PINS);
			MCI_CONTROL_DDR |= MCI_CONTROL_PINS;

			// set sampling point xx us after Ton + DeadTime - during PWM_On
			ToCMPxH( TIM1->CCR4H, (hCntDeadDtime+SAMPLING_POINT_DURING_TON_CNT) );
			ToCMPxL( TIM1->CCR4L, (hCntDeadDtime+SAMPLING_POINT_DURING_TON_CNT) );

		}
	#endif

	#if (BEMF_SAMPLING_METHOD == BEMF_SAMPLING_TOFF)
		#ifdef DEBUG_PINS
			// Info PINS
			PWM_ON_SW_PORT &= (u8)(~PWM_ON_SW_PIN);
		#endif

		Z_Detection_Type = Z_DETECT_PWM_OFF;
		//make control lines floating Input.
		MCI_CONTROL_DDR &= (u8)(~MCI_CONTROL_PINS);

		// set sampling point xx us before Ton - during PWM_Off
		ToCMPxH( TIM1->CCR4H, (hArrPwmVal-SAMPLING_POINT_DURING_TOFF_CNT) );
		ToCMPxL( TIM1->CCR4L, (hArrPwmVal-SAMPLING_POINT_DURING_TOFF_CNT) );
	#endif

	#if (BEMF_SAMPLING_METHOD == BEMF_SAMPLING_TON)
		#ifdef DEBUG_PINS
			// Info PINS
			PWM_ON_SW_PORT |= PWM_ON_SW_PIN;
		#endif
		Z_Detection_Type = Z_DETECT_PWM_ON;
		//Make control line (P-P) output low
		MCI_CONTROL_DR &= (u8)(~MCI_CONTROL_PINS);
		MCI_CONTROL_DDR |= MCI_CONTROL_PINS;

		// set sampling point xx us after Ton + DeadTime - during PWM_On
		ToCMPxH( TIM1->CCR4H, (hCntDeadDtime+SAMPLING_POINT_DURING_TON_CNT) );
		ToCMPxL( TIM1->CCR4L, (hCntDeadDtime+SAMPLING_POINT_DURING_TON_CNT) );
	#endif
}

void SetSamplingPoint_Current(void)
{
	// set sampling point xx us after Ton + DeadTime - during PWM_On
	ToCMPxH( TIM1->CCR4H, (hCntDeadDtime+SAMPLING_POINT_DURING_TON_CNT) );
	ToCMPxL( TIM1->CCR4L, (hCntDeadDtime+SAMPLING_POINT_DURING_TON_CNT) );
}

void DelayCoefAdjust(void)
{
	BEMF_Rising_Factor = g_pBLDC_Struct->pBLDC_Var->bRising_Delay;
	BEMF_Falling_Factor = g_pBLDC_Struct->pBLDC_Var->bFalling_Delay;
}

#ifdef LS_GPIO_CONTROL
	void LS_GPIO_MANAGE(void)
	{		
		if ((LS_Steps[Current_Step] & LS_A) == 0)
		{
			// Deactivate A
			LS_A_PORT->ODR &= (u8)(~LS_A_PIN);			
		}
		else
		{
			// Activate A
			LS_A_PORT->ODR |= LS_A_PIN;			
		}
		
		if ((LS_Steps[Current_Step] & LS_B) == 0)
		{
			// Deactivate B
			LS_B_PORT->ODR &= (u8)(~LS_B_PIN);			
		}
		else
		{
			// Activate B
			LS_B_PORT->ODR |= LS_B_PIN;			
		}
		
		if ((LS_Steps[Current_Step] & LS_C) == 0)
		{
			// Deactivate C
			LS_C_PORT->ODR &= (u8)(~LS_C_PIN);			
		}
		else
		{
			// Activate C
			LS_C_PORT->ODR |= LS_C_PIN;			
		}
	}
	
	void LS_GPIO_OFF(void)
	{
		// Deactivate A
		LS_A_PORT->ODR &= (u8)(~LS_A_PIN);
		// Deactivate B
		LS_B_PORT->ODR &= (u8)(~LS_B_PIN);
		// Deactivate C
		LS_C_PORT->ODR &= (u8)(~LS_C_PIN);		
	}
	
	void LS_GPIO_BRAKE(void)
	{
		// Deactivate A
		LS_A_PORT->ODR &= (u8)(~LS_A_PIN);
		// Activate B
		LS_B_PORT->ODR |= LS_B_PIN;
		// Activate C
		LS_C_PORT->ODR |= LS_C_PIN;		
	}
	
	void LS_GPIO_BOOT(void)
	{
		// Activate A
		LS_A_PORT->ODR |= LS_A_PIN;
		// Activate B
		LS_B_PORT->ODR |= LS_B_PIN;
		// Activate C
		LS_C_PORT->ODR |= LS_C_PIN;		
	}
#endif

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
